Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Spu/Std/IfxSpu.h
/** \brief Configuration structure for SPU
 */
typedef struct
{
    IfxSpu_FftInputConfig     input;                                 /**< \brief Configuration structure for FFT input */
    IfxSpu_CfarCAConfig       cfarCA;                                /**< \brief Configuration structure for CA-CFAR algorithm */
    IfxSpu_CfarGOSConfig      cfarGOS;                               /**< \brief Configuration structure for GOS-CFAR algorithm */
    IfxSpu_LocalMaxConfig     localMax;                              /**< \brief Configuration structure for Local Maximum unit */
    IfxSpu_BinRejectionConfig binrej;                                /**< \brief Configuration structure for Bin Rejection unit */
    uint16                    nciWeights[IFXSPU_MAX_ANTENNAE];       /**< \brief Antennae scaling factors */
    IfxSpu_MagnitudeConfig    magnitude;                             /**< \brief Configuration structure for Magnitude approximation */
    IfxSpu_PassConfig         pass[2];                               /**< \brief Configuration Structure for Pass mode registers */
} IfxSpu_SlotConfig;

/** \brief Structure for statistical output
 */
typedef struct
{
    uint32 minPwr;          /**< \brief Minimum power */
    uint32 maxPwr;          /**< \brief Maximum power */
    uint32 meanPwr;         /**< \brief Mean power */
    uint32 variance;        /**< \brief Variance */
    uint16 minIdx;          /**< \brief Minimum Index */
    uint16 maxIdx;          /**< \brief Maximum Index */
    uint32 filler[3];       /**< \brief Filler to align into EMEM bus width */
} IfxSpu_StatisticalOutput;

/** \} */

typedef struct
{
    IfxSpu_TriggerMode        mode;                   /**< \brief Trigger mode for the slot. (Not the nextSlot) */
    IfxSpu_ClockDivisionRatio clkDiv;                 /**< \brief Clock Divider */
    boolean                   trigger;                /**< \brief If set to TRUE, SPU will be triggered to commence data processing */
    boolean                   attentionRequest;       /**< \brief If set to TRUE, then a service request interrupt will be generated when the execution of the configuration is completed, even if this is not the last configuration in a linked list. */
    boolean                   crossTrigger;           /**< \brief If set to TRUE,an event will be triggered at the end of execution of the current configuration. */
} IfxSpu_CtrlConfig;

/** \brief Configuration structure for Log2 power summation unit contro
 */
typedef struct
{
    boolean enabled;           /**< \brief Enable / Disable choice for the power summation */
    uint32  baseAddress;       /**< \brief Base address to be used when writing data to Radar Memory */
} IfxSpu_Log2PowerSummationConfig;

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Retruns the Fft size code from length
 * \param length Fft length
 * \return Size code
 */
IFX_INLINE IfxSpu_FftSize IfxSpu_getSizeCode(uint32 length);

/** \brief Returns the status of SPU busy
 * \param spu Pointer to register base
 * \return True, if SPU is busy\n
 * False, if SPU is not busy
 */
IFX_INLINE boolean IfxSpu_isBusy(Ifx_SPU *spu);

/** \brief Is CFAR Mode
 * \param mode CFAR Mode
 * \return True if the mode is CFAR, False otherwise
 */
IFX_INLINE boolean IfxSpu_isCfarMode(IfxSpu_CFAR_Mode mode);

/** \brief Is Local Max Mode
 * \param mode CFAR Mode
 * \return True if the mode is Local Max, False otherwise
 */
IFX_INLINE boolean IfxSpu_isLocalMaxMode(IfxSpu_CFAR_Mode mode);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param spu Pointer to SPU module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxSpu_isModuleSuspended(Ifx_SPU *spu);

/** \brief Rejects the selected bin
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param binNumber Number of the bin that needs to be removed
 * \return None
 */
IFX_INLINE void IfxSpu_rejectBin(IfxSpu_ConfigSlot *slot, uint16 binNumber);

/** \brief Configure the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param spu Pointer to SPU module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxSpu_setSuspendMode(Ifx_SPU *spu, IfxSpu_SuspendMode mode);

/** \brief Setup the Scalar addition
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param operand Additive scaling factor for FFT output data
 * \return None
 */
IFX_INLINE void IfxSpu_setupScalarAddition(IfxSpu_ConfigSlot *slot, uint32 operand);

/** \brief Setup the Scalar multiplication
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param operand Multiplicative scaling factor to be applied to the FFT output data
 * \return None
 */
IFX_INLINE void IfxSpu_setupScalarMultiplication(IfxSpu_ConfigSlot *slot, uint32 operand);

/** \brief Returns base pointer of configuration RAM
 * \param spu Pointer to SPU Base register
 */
IFX_INLINE void *IfxSpu_getConfigRamPtr(Ifx_SPU *spu);

/** \brief Check whether a slot as input from RIF
 * \param slot SPU config slot
 */
IFX_INLINE boolean IfxSpu_isRifInput(IfxSpu_ConfigSlot *slot);

/** \brief Check whether a slot as complex input format
 * \param slot SPU config slot
 */
IFX_INLINE boolean IfxSpu_isComplexInput(IfxSpu_ConfigSlot *slot);

/** \brief Size in bytes which is aligned to EMEM bus size
 */
IFX_INLINE uint32 IfxSpu_alignToBusSize(uint32 datasetSize);

/** \brief RM input sample size in bytes
 */
IFX_INLINE uint32 IfxSpu_getInputSampleSize(IfxSpu_RM_InputDataFormat format);

/** \brief ODP sample size in bytes
 */
IFX_INLINE uint32 IfxSpu_getFftSampleSize(IfxSpu_ODP_Format format);

