Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Spu/Std/IfxSpu.h
/** \brief ODP dataset size in bytes
 * \param nBins Number of bins
 */
IFX_INLINE uint32 IfxSpu_getFftDatasetSize(uint32 nBins, IfxSpu_ODP_Format format);

/** \brief NCI dataset size in bytes
 * \param nBins Number of bins
 */
IFX_INLINE uint32 IfxSpu_getNciDatasetSize(uint32 nBins, IfxSpu_NCI_OutputFormat format);

/** \brief Summation dataset size in bytes
 * \param nBins Number of bins
 */
IFX_INLINE uint32 IfxSpu_getSummationDatasetSize(uint32 nBins, IfxSpu_Summation_DataFormat format, IfxSpu_Summation_Precision precision);

/** \brief Thresholding (CFAR or LocalMax) dataset size in bytes
 * \param Nf Number of bins
 */
IFX_INLINE uint16 IfxSpu_getThresholdingOutputSize(uint16 Nf);

/** \brief Resets the PACTR counter
 * \param slot
 * \return None
 */
IFX_INLINE void IfxSpu_resetPactr(IfxSpu_ConfigSlot *slot);

/**
 * \return None
 */
IFX_INLINE void IfxSpu_calculateAndWriteRegisterCrc(IfxSpu_ConfigSlot *slot);

/**
 * \return None
 */
IFX_INLINE void IfxSpu_clearMath1Config(IfxSpu_Math1Config *config);

/**
 * \return None
 */
IFX_INLINE void IfxSpu_clearInputConfig(IfxSpu_FftInputConfig *config);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Check the config slot
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param caller caller
 * \param line line
 * \return None
 */
IFX_EXTERN void IfxSpu_checkConfigSlot(IfxSpu_ConfigSlot *slot, const char *caller, uint32 line);

/** \brief Disables the SPU module
 * \param spu Pointer to register base
 * \return None
 */
IFX_EXTERN void IfxSpu_disableModule(Ifx_SPU *spu);

/** \brief Returns the module index of the selected SPU module
 * \param spu Pointer to SPU module registers
 * \return SPU module register address
 */
IFX_EXTERN Ifx_SPU *IfxSpu_getAddress(IfxSpu_Index spu);

/** \brief Get the configuration slot of an SPU module
 * \param spu Pointer to register base
 * \param slotNr If 0 will return pointer to ID_CONF register of the spu, Else pointer to slotNr in the Configuration RAM. Maximum value of slotNr is \ref IFXSPU_CONFIG_SLOT_MAX.
 * \return Pointer to a configuration slot.
 */
IFX_EXTERN IfxSpu_ConfigSlot *IfxSpu_getConfigSlot(Ifx_SPU *spu, uint32 slotNr);

/** \brief Get the data source of a configuration slot
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \return Processing data source
 */
IFX_EXTERN IfxSpu_DataSource IfxSpu_getDataSource(IfxSpu_ConfigSlot *slot);

/** \brief Returns the module index of the selected SPU module
 * \param spu Specifies the pointer to the base of SPU registers
 * \return Module index
 */
IFX_EXTERN IfxSpu_Index IfxSpu_getIndex(Ifx_SPU *spu);

/** \brief Get number of connected antennae when the input is from RIF, not from EMEM.
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \return Number of connected antennae when the input is from RIF\n
 * Zero when the input is from EMEM
 */
IFX_EXTERN uint16 IfxSpu_getNumConnectedAntennae(IfxSpu_ConfigSlot *slot);

/** \brief Get number of input samples per vector.
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \return Number of input samples per vector.
 */
IFX_EXTERN uint16 IfxSpu_getNumInputSamples(IfxSpu_ConfigSlot *slot);

/** \brief Get number of input ramps, when the input is from RIF, not from EMEM
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \return Number of ramps when the input is from RIF\n
 * Zero when the input is from EMEM
 */
IFX_EXTERN uint16 IfxSpu_getNumRamps(IfxSpu_ConfigSlot *slot);

/** \brief Initialises the SPU module
 * \param spu Pointer to register base
 * \param config Configuration structure for module
 * \return None
 */
IFX_EXTERN void IfxSpu_initModule(Ifx_SPU *spu, const IfxSpu_ModuleConfig *config);

/** \brief Initialises the module config structure
 * \param config Configuration structure for module
 * \return None
 */
IFX_EXTERN void IfxSpu_initModuleConfig(IfxSpu_ModuleConfig *config);

/** \brief Load values into configuration RAM
 * \param spu Pointer to register base
 * \param dataPtr Pointer to the location of source data to load
 * \param offset32 Offset in the configuration RAM (in 32-bit words)
 * \param count32 Size of data in the source to load into the configuration RAM (in 32-bit words)
 * \return None
 */
IFX_EXTERN void IfxSpu_loadConfigRAM(Ifx_SPU *spu, const void *dataPtr, uint32 offset32, uint32 count32);

/** \brief Reloads the configuration
 * \param spu Pointer to register base
 * \param slotNr Configuration slot number. Value should be non-zero. Maximum is \ref IFXSPU_CONFIG_SLOT_MAX.
 * \return None
 */
IFX_EXTERN void IfxSpu_reloadConfig(Ifx_SPU *spu, uint32 slotNr);

/** \brief Reset the Non - Coherent Integration Antennae scaling factors
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \return None
 */
IFX_EXTERN void IfxSpu_resetNciWeights(IfxSpu_ConfigSlot *slot);

/** \brief Sets the pass mode of input DMA engine
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passMode Double pass configuration mode
 * \return None
 */
IFX_EXTERN void IfxSpu_setPassMode(IfxSpu_ConfigSlot *slot, IfxSpu_PassMode passMode);

/** \brief Setup the Bin Rejection unit
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for Bin Rejection uint
 * \return None
 */
IFX_EXTERN void IfxSpu_setupBinRejection(IfxSpu_ConfigSlot *slot, const IfxSpu_BinRejectionConfig *config);

/** \brief Setup the CFAR module
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for CFAR
 * \return None
 */
IFX_EXTERN void IfxSpu_setupCfar(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_CfarConfig *config);

