Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Spu/Std/IfxSpu.h
/** \brief Setup the CFAR CA algorithm
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for CA-CFAR algorithm
 * \return None
 */
IFX_EXTERN void IfxSpu_setupCfarCA(IfxSpu_ConfigSlot *slot, const IfxSpu_CfarCAConfig *config);

/** \brief Setup the CFAR GOS algorithm
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for GOS-CFAR algorithm
 * \return None
 */
IFX_EXTERN void IfxSpu_setupCfarGOS(IfxSpu_ConfigSlot *slot, const IfxSpu_CfarGOSConfig *config);

/** \brief Setup the config sequence
 * \param spu Pointer to register base
 * \param slotNr slot Nr to configure.
 * \param nextSlotNr Next slot number. If zero, slot pointed by slotNr will be the last.
 * \param ctrlConfig CTRL Configuration structure
 * \return None
 */
IFX_EXTERN void IfxSpu_setupConfigSequence(Ifx_SPU *spu, uint32 slotNr, uint32 nextSlotNr, IfxSpu_CtrlConfig *ctrlConfig);

/** \brief Setup the FFT streaming processor, Initialises the input and output parameters for FFT engine
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for FFT engine
 * \return None
 */
IFX_EXTERN void IfxSpu_setupFft(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_FftConfig *config);

/** \brief Setup the FFT output , Initialises the parameters for Output Data Processor
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for FFT output
 * \return None
 */
IFX_EXTERN void IfxSpu_setupFftOutput(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_FftOutputConfig *config);

/** \brief Setup the Histogram
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Histogram
 * \return None
 */
IFX_EXTERN void IfxSpu_setupHistogram(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_HistogramConfig *config);

/** \brief Setup the input for FFT, Initialises the parameters for input DMA engine
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for FFT input
 * \return None
 */
IFX_EXTERN void IfxSpu_setupInput(IfxSpu_ConfigSlot *slot, const IfxSpu_FftInputConfig *config);

/** \brief Setup the Local Max unit
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for Local Maximum uint
 * \return None
 */
IFX_EXTERN void IfxSpu_setupLocalMax(IfxSpu_ConfigSlot *slot, const IfxSpu_LocalMaxConfig *config);

/** \brief Setup the Magnitude
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param config Configuration structure for Magnitude approximation
 * \return None
 */
IFX_EXTERN void IfxSpu_setupMagnitude(IfxSpu_ConfigSlot *slot, IfxSpu_MagnitudeConfig *config);

/** \brief Setup the Math1 uint, Initialises the parameters for Math1 uint of the streaming processor1
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Math1 uint
 * \return None
 */
IFX_EXTERN void IfxSpu_setupMath1(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_Math1Config *config);

/** \brief Setup the Non - Coherent Integration unit
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Non-Coherent intergration
 * \return None
 */
IFX_EXTERN void IfxSpu_setupNci(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_NciConfig *config);

/** \brief Setup the Non - Coherent Integration Antennae scaling factor
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param weights Antennae scaling factors
 * \return None
 */
IFX_EXTERN void IfxSpu_setupNciWeights(IfxSpu_ConfigSlot * slot, uint16 weights[IFXSPU_MAX_ANTENNAE]);

/** \brief Setup the Power Information Channel
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Power Information Channel
 * \return None
 */
IFX_EXTERN void IfxSpu_setupPowerChannel(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_PowerOutputConfig *config);

/** \brief Setup the Sideband statistics
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Sideband Statistics
 * \return None
 */
IFX_EXTERN void IfxSpu_setupSidebandStatistics(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_SidebandStatisticsConfig *config);

/** \brief Setup the Summation unit
 * \param slot Pointer to a configuration slot (see \ref IfxSpu_getConfigSlot())
 * \param passId Processing instance number to choose the register instance for base engine (BEx)
 * \param config Configuration structure for Summation unit
 * \return None
 */
IFX_EXTERN void IfxSpu_setupSummation(IfxSpu_ConfigSlot *slot, IfxSpu_PassId passId, const IfxSpu_SummationConfig *config);

/** \brief Trigger the SPU operation by software
 * \param spu Pointer to register base
 * \return None
 */
IFX_EXTERN void IfxSpu_swTrigger(Ifx_SPU *spu);

/** \brief Function to compute the value for SPU_REGCRC
 * Example usage:
 * uint32 configSlotNr = 0; // 0 = SFR slot, 1 = slot in Configuration RAM.
 * uint32 regcrc = IfxSpu_calculateRegisterCrc(&MODULE_SPU0, configSlotNr);
 * slot->REGCRC.U = regcrc;
 */
IFX_EXTERN uint32 IfxSpu_calculateRegisterCrc(IfxSpu_ConfigSlot *slot);

